xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/03.controller_unit_sensor/system/libs/fwlib/py32l090_hal_flash_ex.c
  return status;
}

/**
  * @brief  Get the Option bytes configuration.
  * @param  pOBInit pointer to an FLASH_OBInitStruct structure that contains the
  *         configuration information.
  * @note   pOBInit->PCROPConfig should indicate which area is requested for PCROP, 
  *         else no information will be returned.
  * @retval None
  */
void HAL_FLASHEx_OBGetConfig(FLASH_OBProgramInitTypeDef *pOBInit)
{
  pOBInit->OptionType = (OPTIONBYTE_WRP | OPTIONBYTE_RDP | OPTIONBYTE_USER);

  /* Get Write protection level */
  pOBInit->WRPSector = FLASH_OB_GetWRP();

  /* Get Read protection level */
  pOBInit->RDPLevel = FLASH_OB_GetRDP();

  /* Get the user option bytes */
  pOBInit->USERConfig = FLASH_OB_GetUser();

  if ((pOBInit->PCROPConfig == FLASH_BANK_0) || (pOBInit->PCROPConfig == FLASH_BANK_1))
  {
    pOBInit->OptionType |= OPTIONBYTE_PCROP;
    /* Get the Proprietary code readout protection */
    FLASH_OB_GetPCROP(&(pOBInit->PCROPConfig), &(pOBInit->PCROPStartAddr), &(pOBInit->PCROPEndAddr));
  }
  else
  {
    /* Nothing to do */
  }
}

/**
  * @}
  */

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/

/** @addtogroup FLASHEx_Private_Functions
  * @{
  */
/**
  * @brief  Mass erase of FLASH memory.
  * @param  Banks Banks to be erased.
  *         This parameter can be one of the following values:
  *            @arg FLASH_BANK_0: Bank0 to be erased
  *            @arg FLASH_BANK_1: Bank1 to be erased
  * @retval None
  */
void FLASH_MassErase(uint32_t Banks)
{
  /* Check the parameters */
  assert_param(IS_FLASH_BANK(Banks));

  if(Banks == FLASH_BANK_0)
  {
    SET_BIT(FLASH->CR, FLASH_CR_MER0);
  }
  else
  {
    SET_BIT(FLASH->CR, FLASH_CR_MER1);
  }
  
  /* Set the Mass Erase Bit for the bank if requested */
  if(READ_BIT(FLASH->OPTR, FLASH_OPTR_BFB) == 0)
  {
    if(Banks == FLASH_BANK_0)
    {
      *(__IO uint32_t *)(FLASH_BASE) = 0x12344321;
    }
    else
    {
      *(__IO uint32_t *)(FLASH_BASE + (FLASH_SIZE >> 1)) = 0x12344321;
    }
  }
  else
  {
    if(Banks == FLASH_BANK_0)
    {
      *(__IO uint32_t *)(FLASH_BASE + (FLASH_SIZE >> 1)) = 0x12344321;
    }
    else
    {
      *(__IO uint32_t *)(FLASH_BASE) = 0x12344321;
    }
  }
}

/**
  * @brief  Erase the specified FLASH memory page.
  * @param  PageAddress FLASH page to erase.
  *         This parameter must be a value between 0 and (max number of pages in the bank - 1).
  * @retval None
  */
void FLASH_PageErase(uint32_t PageAddress)
{
  /* Proceed to erase the page */
  SET_BIT(FLASH->CR, FLASH_CR_PER);
  *(__IO uint32_t *)(PageAddress) = 0x12344321;
}

/**
  * @brief  Sector erase of FLASH memory
  * @param  SectorAddress sector erase address
  * @retval None
  */
void FLASH_SectorErase(uint32_t SectorAddress)
{
  SET_BIT(FLASH->CR, FLASH_CR_SER);
  *(__IO uint32_t *)(SectorAddress) = 0x12344321;
}

/**
  * @brief  Page program of FLASH memory
  * @param  Address  Specifies the address to be programmed.
  * @param  DataAddress  Specifies the data to be programmed
  * @retval None
  */
void FLASH_Program_Page(uint32_t Address, uint32_t * DataAddress)
{
  uint8_t index=0;
  uint32_t dest = Address;
  uint32_t * src = DataAddress;
  uint32_t primask_bit;

  SET_BIT(FLASH->CR, FLASH_CR_PG);
  /* Enter critical section */
  primask_bit = __get_PRIMASK();
  __disable_irq();
  /* 64 words*/
  while(index < 64U) 
  {
    *(uint32_t *)dest = *src;
    src += 1U;
    dest += 4U;
    index++;
    if(index == 63)
    {
      SET_BIT(FLASH->CR, FLASH_CR_PGSTRT);
    }
  }
  /* Exit critical section: restore previous priority mask */
  __set_PRIMASK(primask_bit);
}

/**
  * @brief  UserData erase 
  * @retval None
  */
void FLASH_UserDataErase(uint32_t UserDataAddress)
{
  SET_BIT(FLASH->CR, FLASH_CR_UPER);
  *(__IO uint32_t *)(UserDataAddress) = 0x12344321;
}

/**
  * @brief  Program the UserData
  * @retval None
  */
void FLASH_Program_UserData(uint32_t Address, uint32_t * DataAddress)
{
  uint8_t index=0;
  uint32_t dest = Address;
  uint32_t * src = DataAddress;
  uint32_t primask_bit;

  SET_BIT(FLASH->CR, FLASH_CR_UPG);
  /* Enter critical section */
  primask_bit = __get_PRIMASK();
  __disable_irq();
  /* 64 words*/
  while(index<64U)
  {
    *(uint32_t *)dest = *src;
    src += 1U;
    dest += 4U;
    index++;
    if(index==63)
    {
      SET_BIT(FLASH->CR, FLASH_CR_UPGSTRT);
    }
  }

  /* Exit critical section: restore previous priority mask */
  __set_PRIMASK(primask_bit);
}

/**
  * @brief  Configure the write protection area into Option Bytes.
  * @param  WRPArea specifies the area to be configured.
  *         This parameter can be a combination of the following values:
  *            @arg OB_WRP_BANK0_SECTOR_0         : Flash Bank 0 Sector 0
  *            @arg OB_WRP_BANK0_SECTOR_1         : Flash Bank 0 Sector 1
  *            @arg OB_WRP_BANK0_SECTOR_2         : Flash Bank 0 Sector 2
  *            @arg OB_WRP_BANK0_SECTOR_3         : Flash Bank 0 Sector 3
  *            @arg OB_WRP_BANK0_SECTOR_4         : Flash Bank 0 Sector 4
  *            @arg OB_WRP_BANK0_SECTOR_5         : Flash Bank 0 Sector 5
  *            @arg OB_WRP_BANK0_SECTOR_6         : Flash Bank 0 Sector 6
  *            @arg OB_WRP_BANK0_SECTOR_7         : Flash Bank 0 Sector 7
  *            @arg OB_WRP_BANK0_SECTOR_8         : Flash Bank 0 Sector 8
  *            @arg OB_WRP_BANK0_SECTOR_9         : Flash Bank 0 Sector 9
  *            @arg OB_WRP_BANK0_SECTOR_10        : Flash Bank 0 Sector 10
  *            @arg OB_WRP_BANK0_SECTOR_11        : Flash Bank 0 Sector 11
  *            @arg OB_WRP_BANK0_SECTOR_12        : Flash Bank 0 Sector 12
  *            @arg OB_WRP_BANK0_SECTOR_13        : Flash Bank 0 Sector 13
  *            @arg OB_WRP_BANK0_SECTOR_14        : Flash Bank 0 Sector 14
  *            @arg OB_WRP_BANK0_SECTOR_15        : Flash Bank 0 Sector 15
  *            @arg OB_WRP_BANK1_SECTOR_0         : Flash Bank 1 Sector 0
  *            @arg OB_WRP_BANK1_SECTOR_1         : Flash Bank 1 Sector 1
  *            @arg OB_WRP_BANK1_SECTOR_2         : Flash Bank 1 Sector 2
  *            @arg OB_WRP_BANK1_SECTOR_3         : Flash Bank 1 Sector 3
  *            @arg OB_WRP_BANK1_SECTOR_4         : Flash Bank 1 Sector 4
  *            @arg OB_WRP_BANK1_SECTOR_5         : Flash Bank 1 Sector 5
  *            @arg OB_WRP_BANK1_SECTOR_6         : Flash Bank 1 Sector 6
  *            @arg OB_WRP_BANK1_SECTOR_7         : Flash Bank 1 Sector 7
  *            @arg OB_WRP_BANK1_SECTOR_8         : Flash Bank 1 Sector 8
  *            @arg OB_WRP_BANK1_SECTOR_9         : Flash Bank 1 Sector 9
  *            @arg OB_WRP_BANK1_SECTOR_10        : Flash Bank 1 Sector 10
  *            @arg OB_WRP_BANK1_SECTOR_11        : Flash Bank 1 Sector 11
  *            @arg OB_WRP_BANK1_SECTOR_12        : Flash Bank 1 Sector 12
  *            @arg OB_WRP_BANK1_SECTOR_13        : Flash Bank 1 Sector 13
  *            @arg OB_WRP_BANK1_SECTOR_14        : Flash Bank 1 Sector 14
  *            @arg OB_WRP_BANK1_SECTOR_15        : Flash Bank 1 Sector 15
  *            @arg OB_WRP_BANK0_Pages0to31       : Flash BANK 0 Sector 0
  *            @arg OB_WRP_BANK1_Pages32to63      : Flash BANK 1 Sector 1 
  *            @arg OB_WRP_BANK0_Pages64to95      : Flash BANK 0 Sector 2
  *            @arg OB_WRP_BANK0_Pages96to127     : Flash BANK 0 Sector 3            
  *            @arg OB_WRP_BANK0_Pages128to159    : Flash BANK 0 Sector 4          
  *            @arg OB_WRP_BANK0_Pages160to191    : Flash BANK 0 Sector 5         
  *            @arg OB_WRP_BANK0_Pages192to223    : Flash BANK 0 Sector 6          
  *            @arg OB_WRP_BANK0_Pages224to255    : Flash BANK 0 Sector 7          
  *            @arg OB_WRP_BANK0_Pages256to287    : Flash BANK 0 Sector 8           
  *            @arg OB_WRP_BANK0_Pages288to319    : Flash BANK 0 Sector 9          
  *            @arg OB_WRP_BANK0_Pages320to351    : Flash BANK 0 Sector 10           
  *            @arg OB_WRP_BANK0_Pages352to383    : Flash BANK 0 Sector 11        
  *            @arg OB_WRP_BANK0_Pages384to415    : Flash BANK 0 Sector 12          
  *            @arg OB_WRP_BANK0_Pages416to447    : Flash BANK 0 Sector 13         
  *            @arg OB_WRP_BANK0_Pages448to479    : Flash BANK 0 Sector 14           
  *            @arg OB_WRP_BANK0_Pages480to511    : Flash BANK 0 Sector 15         
  *            @arg OB_WRP_BANK1_Pages0to31       : Flash BANK 1 Sector 0         
  *            @arg OB_WRP_BANK1_Pages32to63      : Flash BANK 1 Sector 1        
  *            @arg OB_WRP_BANK1_Pages64to95      : Flash BANK 1 Sector 2         
  *            @arg OB_WRP_BANK1_Pages96to127     : Flash BANK 1 Sector 3        
  *            @arg OB_WRP_BANK1_Pages128to159    : Flash BANK 1 Sector 4        
  *            @arg OB_WRP_BANK1_Pages160to191    : Flash BANK 1 Sector 5        
  *            @arg OB_WRP_BANK1_Pages192to223    : Flash BANK 1 Sector 6         
  *            @arg OB_WRP_BANK1_Pages224to255    : Flash BANK 1 Sector 7          
  *            @arg OB_WRP_BANK1_Pages256to287    : Flash BANK 1 Sector 8          
  *            @arg OB_WRP_BANK1_Pages288to319    : Flash BANK 1 Sector 9         
  *            @arg OB_WRP_BANK1_Pages320to351    : Flash BANK 1 Sector 10          
  *            @arg OB_WRP_BANK1_Pages352to383    : Flash BANK 1 Sector 11      
  *            @arg OB_WRP_BANK1_Pages384to415    : Flash BANK 1 Sector 12        
  *            @arg OB_WRP_BANK1_Pages416to447    : Flash BANK 1 Sector 13        
  *            @arg OB_WRP_BANK1_Pages448to479    : Flash BANK 1 Sector 14         
  *            @arg OB_WRP_BANK1_Pages480to511    : Flash BANK 1 Sector 15       
  *            @arg OB_WRP_AllPages               : ALL Pages 
  * @retval HAL_Status
  */
static HAL_StatusTypeDef FLASH_OB_WRPConfig(uint32_t WRPArea)
{
  HAL_StatusTypeDef status;

  /* Wait for last operation to be completed */
  status = FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);

  if (status == HAL_OK)
  {
    FLASH->WRPR = (uint32_t)(~WRPArea);
  }

